[
  {
    "id": "FullstackEngineerPythonReactallgenders_KertosGmbH",
    "title": "Fullstack Engineer – Python / React (all genders)",
    "company": "Kertos GmbH",
    "location": "Berlin",
    "description": "#### **Kertos Intro**\n\n**Kertos is the fastest\\-growing compliance startup in Europe.**  \n\n  \n\nFollowing our **€14M Series A**, backed by leading VCs and business angels, we are building the **compliance engine for Europe** – faster, smarter, and more automated than ever.  \n\nWith customers like **Enpal, Flink, Personio, and Blacklane**, leading companies trust our AI\\-native platform that automates compliance, scales effortlessly, and makes organizations audit\\-ready in record time.  \n\nThe market is growing by **20% every year**, fueled by regulations like **GDPR, NIS2, DORA, and the AI Act**. We are perfectly positioned to establish Kertos as the European compliance champion.  \n\nThere has never been a better moment to join our team.  \n\n  \n\n**Come shape the future of compliance in Europe with us.**\n\n#### **Your purpose at Kertos**\n\n\nAs a Fullstack Engineer at Kertos – the European Champion for Compliance Automation – you’ll play a key role in shaping our platform into a product of its own class. We turn compliance from a yearly fire drill into a continuous, low\\-friction product experience.  \n\nYou’ll build end\\-to\\-end product experiences – backend to UI – that help companies stay secure, prove trust, and move faster without sacrificing quality. In a cross\\-functional squad, you’ll ship improvements weekly, shape product decisions, and directly influence how modern compliance is done across Europe.  \n\n  \n\n**OUR TEAM SETUP**  \n\nWe work in three cross\\-functional product squads, each focused on one of our core internal products or solutions:  \n\nSquad composition:\n\n  \n\n* 1 Product Manager, 1 Product Designer, 3–4 Fullstack Engineers, 1 Tech Lead\n* **Collaboration style:** Flat hierarchies, shared ownership, and strong cross\\-functional teamwork\n\n**TECH STACK**  \n\n* **Backend**: Python (Django)\n* **Frontend**: React.js, TypeScript\n* **Infrastructure**: AWS, Docker, Kubernetes, terraform, ArgoCD, Karpenter\n* **AI**: LangChain, LangGraph, Langfuse\n* **DevOps \\& Tools**: We experiment with cutting\\-edge tools like Claude Code, Cursor, Copilot, Raycast – and encourage you to push for the best setup for your work\n\n**YOUR RESPONSIBILITIES**  \n\n* **Build the European Champion for Compliance Automation:** Develop and maintain Kertos as the cutting\\-edge category leader. Ship features that cut audit preparation from weeks to hours.\n* **Work across our full tech stack:** Build end\\-to\\-end product experiences that make compliance actions feel effortless – from API to UI.\n* **Make automation feel magical (and safe):** Improve recommendations, workflows, and system reliability so customers can trust the platform.\n* **Own the process:** Drive your work from concept to delivery – and experience the user impact\n* **Boost product quality:** Improve product reliability so customers can trust automation with sensitive processes\n* **Shape engineering excellence:** Improve developer experience, quality, and delivery speed through better tooling, testing, and processes.\n\n#### **The skills, motivation, and mentality you should bring**\n\n* Degree in **Computer Science, Informatics** or equivalent experience\n* Proven track record as a **Software Engineer** with a focus on **web applications**\n* Experience with **software testing** and quality assurance practices\n* **Technical knowledge in parts of our stack: TypeScript (React), Python (Django / FastAPI), databases \\& migrations, Docker**\n* Strong problem\\-solving skills, **ownership mindset**, and a passion for building impactful products\n* Experience with AI engineering is a nice to have\n\n#### **Why Kertos**\n\n* **You are Kertos:** Don’t like something? Could be done better? You have the freedom to push things forward and contribute to making Kertos a great place to work\n* **Unique opportunity:** Join the growing team of one of Europe’s most promising early stages companies and to work directly with our CTO Alex\n* **European funding in the millions:** The EU has funded our AI research with a total of over 2 million euros\n* **Regular Feedback:** We foster an open feedback culture and support your growth with regular 1\\-on\\-1 meetings\n* **Full Flexibility:** Whether at the Berlin office, our Munich HQ or at your home office – we are flexible, and you'll be happy\n* **Keep growing:** To boost your professional and personal growth, we provide you with a Personal Development Budget of 1\\.500€ per year\n* **Cutting Edge Technology:** Leading VCs have invested in our vision to revolutionize how compliance measures are handled sustainably\n* **Mental Health:** We've partnered with nilo to prioritize your well\\-being, offering personalized mental health support for all employees\n* **For Sports Enthusiasts:** We subsidize your Wellpass membership for your physical fitness for a better work\\-life balance\n* **Steep learning curve:** With us you get full responsibility from day 1, push topics forward independently and thus learn a lot\n* **Strong onboarding:**No idea about compliance and its automation? No problem, we'll turn you into an expert and provide you with an onboarding buddy\n* **Teamwork Makes the Dream Work:** We are a strong team that supports each other, and we also have a lot of fun together beyond work and across different locations\n\n#### **Sounds like you are the one we’ve been looking for?**\n\n\nPerfect, let's have a chat! Just send in your CV. We are excited to meet you soon.  \n\nIn case you have any questions, feel free to reach out to our People \\& Culture team. We're happy to answer all your questions.\n\n#### **About us**\n\n\nFounded in 2021 and backed by investors such as Portage, Redstone, 10x Founders, Seed \\+ Speed, and xdeck, we are on a rapid growth trajectory. Today, we are a team of over 45 ambitious talents from 15 nations, united by our mission to transform compliance from a challenge into a seamless standard. With our platform, we help companies implement regulatory requirements effortlessly, cost\\-effectively, and stress\\-free. From our offices in Berlin and Munich, we are driving this vision forward – and this is just the beginning.",
    "url": "https://www.glassdoor.de/job-listing/j?jl=1010028014677",
    "status": "Applied",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "ITSystemsEngineerrelocationtoHamburg_FREENOW",
    "title": "IT Systems Engineer (relocation to Hamburg)",
    "company": "FREE NOW",
    "location": "Berlin, BE, DE",
    "description": "***Location****: Come and join us in Hamburg!*\n\n\n*We are looking for an IT Systems Engineer to join our IT Solutions Team in Hamburg.*  \n\n* *the relocation to Hamburg is required either from the start or after 6 months (with regular travels).*\n\n\n**YOUR DAILY ADVENTURES WILL INCLUDE:**\n---------------------------------------\n\n\n* **Engineer \\& Optimize Systems**: You will elevate IT operations beyond simple SaaS portal administration by treating infrastructure as a software product. This involves defining our systems using Terraform, deploying Python services on Kubernetes, and ensuring all operations meet critical business requirements for security, performance, and stability.\n* **Master of Automation**: You will plan and implement services and automations in code or via our iPaaS platform to improve efficiency, including developing tooling for automated user provisioning and asset management.\n* **Operational Excellence \\& Security**: You will be responsible for the security and efficiency of our infrastructure. This includes conducting essential maintenance, such as upgrading applications, proactively remediating security vulnerabilities, and managing IT incidents, with a strong focus on performing thorough root cause analysis.\n* **Monitor \\& Analyze**: Develop system monitoring and alerting strategies (using tools like Prometheus or Grafana) to enhance support quality. You will use data and logs to identify improvements and scale our operations.\n* **Collaborate \\& Mentor**: Build cross\\-functional relationships to drive initiatives and collaborate with security teams on IT policies. You will actively share knowledge, document processes, and mentor junior team members.\n\n**TO BE SUCCESSFUL IN THIS ROLE:**\n----------------------------------\n\n\n* **Cloud \\& Infrastructure Mindset**: Hands\\-on experience with cloud infrastructure (AWS or GCP) and a solid understanding of Infrastructure as Code principles.\n* **Automation \\& IT Efficiency** **is key!**: You are allergic to toil. If you have to do a task three times, your instinct is to write a script, service or build a recipe in Workato.\n* **Identity \\& SaaS Expertise**: You have deep knowledge of Identity and Access Management (Okta, Active Directory, Azure AD) and experience administering SaaS applications like Google Workspace, Slack, Zoom, and Atlassian (Jira/Confluence).\n* **Security Awareness**: Experience working with security information tools (SIEM like OpenSearch) and a proactive approach to vulnerability remediation.\n* **OS \\& MDM Proficiency**: Hands\\-on experience supporting Mac, Windows, and Linux environments, along with knowledge of Mobile Device Management solutions (SimpleMDM, Jamf, Intune).\n* **Problem Solver \\& Communicator**: You don't just fix issues; you analyze root causes to prevent them. You communicate clearly with both technical and non\\-technical stakeholders and act as a consultant for automation and IT systems.\n* **Data Driven**: You look beyond the tickets and logs to find the story they tell. You use data to identify user pain points and drive improvements that provide tangible benefits to our internal customers, ensuring our technology actually makes their workdays better.\n* You'll need to be **Proactive \\& Self\\-Driven!** Take ownership of tasks and suggest improvements to our IT infrastructure.\n\n\n**Required Technical Skills:**\n\n\n* 3\\+ years of experience of implementation of IT infrastructure, administration in a SaaS heavy environment and user support in a cloud\\-first modern IT environment\n* Experience administering SaaS applications (Okta, Google Workspace, Slack, Zoom) and Atlassian tools (Jira, Confluence).\n* Strong knowledge of Identity and Access Management (Okta, Active Directory, Azure AD).\n* Hands\\-on experience with Cloud Infrastructure (AWS or GCP) and Container/Microservice technologies.\n* Proficiency with CI/CD tools, Git, and Infrastructure as Code (IaC)\n* Knowledge of Mobile Device Management (MDM) for Mac (SimpleMDM, Jamf) and Windows (Intune).\n* Experience with System Monitoring/Alerting (Prometheus, Grafana, Alert Manager) and SIEM tools (OpenSearch).\n* Basic Network architecture knowledge\n* Proficiency in one programming language and understanding of how to efficiently work with APIs.\n* Advanced knowledge of no/low\\-code iPaaS platforms (Workato, Boomi) is a big plus.\n\n**BENEFITS \\& PERKS IN A NUTSHELL:**\n------------------------------------\n\n\n* Flexible working arrangements\n\n\n* LinkedIn Learning\n\n  \n\n\n  \n\n* Sabbatical \\& special leave policies\n\n\n* WeRoad partnership\n\n  \n\n\n  \n\n* Birthday, 24th \\+ 31st December off\n\n\n* Short term EU work policy\n\n  \n\n\n  \n\n* Mobility Credit\n\n\n* Health Insurance\n\n  \n\n\n  \n\n* Employee assistance program\n  \n\n\n  \n\n**DIVERSITY, EQUITY \\& INCLUSION:**\n-----------------------------------\n\n\n\nFreenow is an equal opportunity employer and we consider qualified applicants regardless of race, religion, national origin, gender, gender identity, sexual orientation, disability or age.\n  \n\nWe want you to grow and evolve, bring your true self to work.\n\n  \n\n\n**SEE WHAT OUR AWESOME COLLEAGUES SAY ABOUT US:**\n-------------------------------------------------\n\n  \n\n\n\n**ABOUT FREENOW:**\n------------------\n\n\n\nWe are Freenow, the European taxi app with the broadest multi\\-mobility offering, available in 9 markets and over 180 cities. Our app gives millions of passengers the freedom to move with a wide choice of services including taxis, private hire vehicles, carsharing, car rental, e\\-scooters, e\\-bikes, e\\-mopeds and public transport.\n\n\n\nHeadquartered in Hamburg and led by our CEO Thomas Zimmermann, we are on a mission to make urban mobility more efficient, sustainable and inclusive.\n\n\n\nSince July 2025 we have been part of Lyft, a global mobility platform connecting riders and drivers for billions of rides across North America and Europe. Together we are building a more caring and connected world, creating new opportunities for innovation, growth and impact.",
    "url": "https://de.indeed.com/viewjob?jk=c0ba27784e3321d7",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "JuniorAISolutionManagerinmwd_octonomyAIGmbH",
    "title": "(Junior) AI Solution Manager:in (m/w/d)",
    "company": "octonomy AI GmbH",
    "location": "Köln, NW, DE",
    "description": "#### **Deine Aufgaben**\n\n\nWir bei octonomy sind kein typisches KI\\-Startup: Wir haben Großes vor – und mit dem erfolgreichen Abschluss einer der größten Seed\\-Finanzierungsrunden Europas (20 Mio. USD) schaffen wir die Basis, unsere Vision konsequent zu skalieren. Unsere Mission ist klar: Wir transformieren Unternehmen mit der intelligentesten digitalen Workforce, sodass sie mit uns als Partner eine neue Ära des Wachstums entfalten.  \n\nUnsere AI octo\\-Worker automatisieren Geschäftsprozesse in höchster Qualität – zuverlässig, sicher und frei von Halluzinationen. Namhafte Kund:innen vertrauen uns bereits, und unser Wachstum nimmt stetig Fahrt auf – national wie international.  \n\n  \n\n**Jetzt suchen wir dich:** Als (Junior) AI Solution Manager:in übernimmst du die technische Führung bei der Implementierung von AI\\-Lösungen bei unseren Kund:innen. Du agierst an der Schnittstelle zwischen Business und IT und sorgst dafür, dass technische Integrationen zuverlässig, leistungsstark und zukunftsfähig umgesetzt werden. Dabei arbeitest du eng mit internen Entwickler:innen, Consultants und externen Stakeholdern zusammen.\n\n* **Technische Projektleitung:** Koordination der Implementierung von AI\\-Lösungen in kundenspezifischen IT\\-Umgebungen (z. B. CRM\\-, Ticketing\\- und Wissensplattformen)\n* **Integration \\& Umsetzung:** Effiziente technische Integration von Kundensystemen basierend auf den Spezifikationen des Projektteams\n* **Anforderungsmanagement:** Erhebung, Dokumentation und Prüfung technischer Anforderungen und Datenquellen auf Vollständigkeit, Format und Konsistenz\n* **Teamkoordination:** Leitung eines Teams von AI\\-Entwickler:innen und Identifikation schneller, pragmatischer Lösungen mit analytischem Denken\n* **Stakeholder Management:** Enge Abstimmung mit Kund:innen und Partner:innen zur Sicherstellung reibungsloser API\\-Integrationen\n* **Innovation \\& Weiterentwicklung:** Aktives Verfolgen von Trends in den Bereichen LLMs, Prompt Engineering und AI\\-Infrastruktur\n* **Kommunikation:** Übersetzung komplexer technischer Sachverhalte in verständliche, zielgruppenorientierte Sprache für Kunden und interne Teams\n\n#### **Was du mitbringst**\n\n* **Technisches Verständnis:** Tiefgehende Kenntnisse in IT\\-Architekturen, API\\-Design, Datenverarbeitung und Systemintegration.\n* **Erfahrung in AI\\-Umgebungen:** Fundiertes Know\\-how im Umgang mit AI\\-Modellen, Prompt Engineering und Plattformarchitekturen.\n* **Beratungskompetenz:** Erfahrung im IT\\-Consulting oder als technische Ansprechperson für kundenspezifische Lösungen.\n* **Hands\\-on\\-Mentalität:** Vertraut mit Tools zur Analyse, Protokollierung und Dokumentation technischer Prozesse (z. B. Python, Postman, Swagger).\n* **Struktur \\& Ownership:** Du arbeitest genau, übernimmst Verantwortung und dokumentierst deine Arbeit nachvollziehbar.\n* **Sprachkenntnisse:** Sehr gute Englischkenntnisse in Wort und Schrift; B2 Deutschkenntnisse\n* **Teamgeist:** Du arbeitest gerne interdisziplinär und eng mit Engineers, Consultants und PMOs zusammen.\n\n\nWir suchen keine perfekten Lebensläufe, sondern Menschen, die mitdenken, mitbauen und mitlernen wollen.  \n\n  \n\nWenn du gestalten willst, Verantwortung übernimmst und lieber anpackst als abwartest, passt du perfekt zu uns.#### **Was dich bei uns erwartet**\n\n* Arbeiten in einem der spannendsten KI\\-Unternehmen Europas – mit erfahrenen Gründer:innen und einem wachsenden Team\n* Raum, Verantwortung zu übernehmen und Neues auszuprobieren\n* Flache Hierarchien, klare Strukturen, offener Umgang\n* Flexible Arbeitsmodelle (remote/hybrid)\n* Und: Hier lernst du schnell – nicht, weil du musst, sondern weil du willst.\n\n**Für deine Rolle heißt das:**  \n\n* **Technische Verantwortung in AI\\-Delivery\\-Projekten:** Du trägst dazu bei, dass unsere Plattform auf verlässlichen Daten läuft – und damit echten Kund:innen\\-Mehrwert liefert.\n* **Enge Zusammenarbeit mit unseren technischen Rollen:** Du arbeitest mit IT Consultants, Engineers und PMOs zusammen – mit Fokus auf saubere Daten und nahtlose Integration.\n\n  \n\nLet’s build the future of work – together. Seriously.  \n\n  \n\nBei octonomy erwartet dich ein Umfeld, das Qualität schätzt, Kreativität fördert und echte, messbare Resultate liefert. Wenn du Lust hast, KI praxisnah in den Business\\-Alltag zu bringen und mit uns gemeinsam zu wachsen, freuen wir uns darauf, dich kennenzulernen.  \n\n  \n\nSchreib uns formlos oder mit allem Drum und Dran – Hauptsache, du hast Lust, mitzugestalten.  \n\noctonomy.ai \\| We grow output. Not headcount.#### **Über uns**\n\n\noctonomy ist ein KI\\-Unternehmen mit Sitz in Köln, das sich auf die Entwicklung intelligenter KI\\-Agenten zur Automatisierung von Unternehmensprozessen spezialisiert hat. Mit seiner innovativen Technologie ermöglicht octonomy eine hochqualitative und schnelle Automatisierung von Support Services – von Kundenanfragen bis hin zu internen Mitarbeiter\\- und Partneranfragen. Die Mission des Unternehmens: Hochkomplexe Support\\-Prozesse so einfach automatisierbar machen wie nie zuvor.",
    "url": "https://de.indeed.com/viewjob?jk=d816270a2c2eb362",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "SeniorMachineLearningEngineer-ComputerVisionmfd_MerantixMomenum",
    "title": "Senior Machine Learning Engineer - Computer Vision (m/f/d)",
    "company": "Merantix Momenum",
    "location": "Berlin, BE, DE",
    "description": "**What we do**\n\nMerantix Momentum is a Berlin\\-based AI startup focusing on accelerating AI adoption across many industries through B2B solutions, as well as publicly funded research projects. We work across several domains, including manufacturing, retail, healthcare and many more, transforming businesses as an external machine learning department. We achieve this using our core expertise in state\\-of\\-the\\-art machine learning combined with our culture of rapid iterations to build scalable solutions.\n\n*Please upload a motivation letter with your application explaining why you would like to join our team.*\n\n**Your role**\n\nAre you passionate about developing impactful applications of Machine Learning? The Mission of this role is to bring state\\-of\\-the\\-art deep\\-learning methods to real\\-world applications from ideation and prototyping to production.\n\nThese will be your main responsibilities:\n\n* Acting as a tech lead in major projects;\n* Scope machine learning projects and their technical feasibility through client interaction;\n* Contribute to the next\\-generation AI stack and grow the open source ecosystem;\n* Implement machine learning methods and apply them to real\\-world use cases.\n* Collaborate with data\\-, backend\\-, and frontend engineers in order to build production\\-ready AI solutions;\n* Support junior colleagues by providing guidance, mentorship, and assistance with professional development and project execution\n* Support the manager in the definition and execution of the Computer Vision strategy.\n\n**Your profile**\n\nThe ideal candidate is proficient in software engineering and the latest machine learning and deep learning technologies. You will independently scope, plan, manage, and drive machine learning projects from ideation to the production phase.\n\nYou should have some years of experience in leading CV projects. In addition, you should also be highly experienced in at least one of the following technologies: NLP, GNNs, classic Computer Vision methods, and causal inference.\n\nYou are a great fit for our team if this describes you:\n\n* MSc/PhD in computer science, Machine Learning, or related technical field:\n* Relevant programming skills in Python with a variety of Deep Learning tasks and experience with libraries like PyTorch;\n* Expertise in one or more of the following cloud providers: Google Cloud Platform, AWS, Azure;\n* Relevant experience in independently completing complex technical projects;\n* Comprehensive understanding of the Computer Vision landscape \\& toolkits;\n* You appreciate sound engineering practices like version control, clean code, code review, testing, CI/CD, and automation;\n* Ability to interact with clients, to understand their problems, and to design as well as to explain complex technical solutions;\n* Fluency in English.\n* Nice to have: German proficiency (minimum B1 level)\n\n**What we offer**\n\n* Engaging Topics and Excellence: We offer unique insights into applied machine learning research and development, working with a group of highly talented engineers and entrepreneurs.\n* International Team: We are a dynamic and international team.\n* We offer Visa Sponsorship.\n* Learning and Development: We provide an annual learning and development budget for attending conferences or purchasing educational resources to further develop our employees’ skills. We also hold weekly and monthly events around AI innovation and implementation.\n* Dynamic and open Working Culture: We have a very flat hierarchy, open 360° feedback, and flexibility in our work\\-from\\-home policy as well as working hours.\n* AI Ethics: We are committed to developing ethical AI software and actively foster open discussions on this topic within our team.\n* Brand new office space: Bright and open office situated on the AI Campus in Berlin.\n* Hardware allowance: We give you support to have all the equipment you would need to thrive on your job.\n* Employee benefits: We offer a monthly allowance per employee that can be allocated as desired to one of the following: Mobility \\& transportation (NAVIT), sports (Urban Sports Club) or groceries (Edenred).\n\n**About us:**  \nWe are an equal\\-opportunity employer and value diversity. We consider all applications equally regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity. We strongly encourage individuals from groups traditionally underrepresented in tech to apply, and we can help with immigration.\n\nJob Type: Full\\-time\n\nApplication Question(s):\n\n* Have you architected and deployed a computer vision model that processes real\\-time video streams (\\>30 fps) in a production environment, requiring optimization techniques beyond standard model compression?\n\nWork Location: In person",
    "url": "https://de.indeed.com/viewjob?jk=76d167bff36718a7",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "JuniorDataScientistEngineer-AIMedicalImagingwmd_UnknownCompany",
    "title": "(Junior) Data Scientist/Engineer - AI Medical Imaging (w/m/d)",
    "company": "Unknown Company",
    "location": "München, BY, DE",
    "description": "What we are doing\n  \n  \n\nOur mission is to prevent vision loss and ultimately blindness by developing AI software that assists eye doctors in therapy planning for their patients. We use computer vision deep learning models(AI) trained on thousands of cases and millions of images to identify and predict disease progression. The decision support algorithm targets popular eye diseases like Age\\-related Macular Degeneration (AMD, 7\\.5mio affected in Germany alone).\n  \n  \n\nTasks\n  \n  \n\n* Develop and optimize machine learning algorithms for medical imaging applications to enhance the accuracy and efficiency of ophthalmological diagnostics.\n* Collaborate with cross\\-functional teams, including software engineers and clinicians, to integrate AI solutions into existing medical workflows and tools.\n* Analyze large datasets from various sources, ensuring data quality and integrity, to train and validate AI models for detecting eye\\-related conditions.\n* Stay updated with the latest advancements in AI and medical imaging technologies, applying innovative approaches to improve product offerings and patient outcomes.\n\n\nRequirements\n  \n  \n\nWhat we are looking for\n  \n  \n\nYour must\\-haves\n  \n  \n\n* 2\\+ years of applied experience in computer vision and medical image analysis, including 2D/3D image processing, segmentation, and spatial normalization.\n* First professional experience in industry applied to machine learning and deep learning, including a working knowledge of CNNs and UNet architectures.\n* Strong programming skills in Python and experience with common machine learning frameworks such as PyTorch or TensorFlow.\n* A degree in Data Science, Computer Science, Bioengineering, (Medical) Physics, or a similar quantitative field.\n\n\nYour nice\\-to\\-haves\n  \n  \n\n* Experience in analyzing and evaluating data using relational databases like PostgreSQL.\n* Experience working in interdisciplinary teams of doctors, data scientists, data and software engineers\n* Working\\-level English (C1 or higher).\n\n\nBenefits\n  \n  \n\nWhat we offer\n  \n  \n\n* Direct impact on improving the quality of life for patients by preventing blindness.\n* High personal responsibility for your projects and the opportunity for fast professional growth.\n* Flexible working hours and remote work options.\n* Competitive payment and a vibrant startup culture within a great, international team.\n* A central office located in Munich’s startup hub.\n\n\nReach out to us with information about your availability, salary expectations and a link to your conclusive profile (GitHub, LinkedIn, CV). Please share with us why you want to help us in preventing blindness with AI.",
    "url": "https://de.indeed.com/viewjob?jk=36cd0a1f937c554d",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "SeniorMicrosoftAzureAIMLArchitectmwd_Devoteam",
    "title": "Senior Microsoft Azure AI/ML Architect (m/w/d)",
    "company": "Devoteam",
    "location": "Frankfurt am Main, HE, DE",
    "description": "- Do you want to not only experience but actively shape the unique **DNA** of **Microsoft** ? Then **Devoteam M** **Cloud** is the right place for you!\n  \n\n  \n\nOur core business is cloud\\-based enterprise customer projects, where we drive the most modern Microsoft technologies.\n  \n\n  \n\nThe building blocks that distinguish us:\n\n\n\n\t* 2,100 Microsoft certifications completed in 2022\n\t* 1,000 Microsoft experts in EMEA\n\t* 600 customers\n\t* 25 years of industry experience\n\t* 18 Advanced Specializations \\- including \"Azure Virtual Desktop Advanced Specialization\" and \"Modernization of Web Applications to Microsoft Azure\"\n\t* 6 Solution Partner Designations\n\t3 MVPs  \n\t*Imagine being part of one of the most successful IT companies in Europe, leveraging the latest technologies with its customers to elevate them to the next level. Apply now at **Devoteam M Cloud!**\n\n  \n\n\\#AI Driven Tech Consulting\n\n\nYour Benefits: **In addition to our revolutionary New Way of Work culture, you'll enjoy:**\n\n\n\t* **Modern offices** in prime locations in Munich and Frankfurt\n\t* **Flexible hybrid working** with the option to customize your working hours to your individual needs\n\t* Our **Devoteam Academy** offers a wide range of certified trainings and language courses\n\t* **International development opportunities** to boost your career at Devoteam\n\t* **Gaming lounge** for your creative break between meetings and calls\n\t* **Get\\-together parties and team events** for regular exchange and fun with your colleagues\n\t* **Employee referral bonuses** for attracting new employees\n\t* **Modern IT equipment** \\- choose the product that suits you best from a variety of options\n\t* **Corporate benefits** with a large selection of numerous offers for almost every area\n\t* **\"Jobrad\" (company bike)** offer with attractive tax advantages for you\n\t* **Company pension scheme, direct insurance, and capital\\-forming benefits** are available to you as additional services\n\t* **Integration Day including mentoring programs** for your perfect start at Devoteam\n\n  \n* **Lead AI Solution Architecture:** Own the end\\-to\\-end architecture for AI/ML solutions on Azure, from concept and design to deployment. Develop high\\-level solution designs that integrate with clients’ existing data platforms and infrastructure.\n* **Client Engagement:** Work closely with enterprise clients to understand business challenges and identify opportunities where AI/ML can drive value (e.g. predictive maintenance in manufacturing, drug discovery insights in pharma, or risk modeling in insurance). Translate these needs into solution roadmaps and technical plans.\n* **Technical Leadership:** Provide hands\\-on technical leadership to delivery teams. Guide Azure AI Engineers and Data Engineers in implementing best practices for data preparation, model development, and cloud deployment. Mentor team members in advanced AI techniques and review designs/code to ensure quality.\n* **MLOps \\& Best Practices:** Establish and enforce MLOps best practices for the team, including reproducible workflows, continuous integration/continuous delivery (CI/CD) for ML models, automated testing, and monitoring of model performance in production. Ensure that solutions are scalable and maintainable over time.\n* **Innovation \\& Generative AI:** Stay abreast of the latest AI trends and Azure services. Evaluate new technologies – from Azure Cognitive Services and Azure OpenAI to emerging open\\-source frameworks for **LLMs** (Large Language Models) and **RAG** (Retrieval\\-Augmented Generation). Incorporate generative AI capabilities where relevant to enhance client solutions (e.g. intelligent document processing with GPT models).\n* **Cross\\-Project Impact:** Oversee and provide guidance on multiple AI projects in parallel, ensuring architectural consistency and reuse of best practices across engagements. Act as the go\\-to expert for solving complex technical problems and making high\\-level design decisions.\n* **Internal Capability Building:** Contribute to Devoteam’s internal Data \\& AI capability. Develop reusable architecture blueprints, accelerators, and reference implementations for AI on Azure. Lead knowledge\\-sharing sessions and training to upskill colleagues, and support the growth of a community of practice around AI/ML.\n\n  \n* **Proven Experience:** 7\\+ years of experience in data analytics and software development, with at least 4–5 years in designing and implementing ML/AI solutions at scale. A track record of delivering production\\-grade AI projects for enterprise clients is essential (this is a senior role and **not suitable for junior candidates** ).\n* **Language Skills: fluent in german and english**\n* **Azure Expertise:** Deep hands\\-on knowledge of Azure data and AI services – including Azure Machine Learning, Azure Databricks, Azure Data Lake/Synapse, Azure Cognitive Services (Text, Vision, Speech), Azure OpenAI and Azure AI Foundry. Ability to architect solutions that leverage these services cohesively.\n* **Architectural Skills:** Strong skills in system design and integration. Comfortable defining solution architectures that encompass data ingestion, feature engineering, model training, deployment (APIs, containers), and monitoring. Familiarity with designing **microservices** or cloud data pipelines is a plus.\n* **MLOps \\& Software Engineering:** Solid understanding of MLOps principles and experience implementing ML lifecycle management (source control, CI/CD for models, model registries, etc.) on Azure or similar platforms. Proficiency in Python and common ML frameworks (scikit\\-learn, TensorFlow/PyTorch) and experience with code review and DevOps processes.\n* **Leadership \\& Communication:** Excellent leadership and interpersonal skills. Able to interface with client stakeholders to explain complex AI concepts in business terms, gather requirements, and drive adoption. Experience leading technical teams or mentoring engineers in a project setting.\n* **AI Knowledge:** Broad knowledge of machine learning and AI techniques (supervised, unsupervised learning, time\\-series, etc.) and familiarity with deep learning and NLP. Exposure to **Generative AI** and LLMs is highly desired – you should understand concepts like prompt engineering and have curiosity about applying these in enterprise scenarios. Deep understanding of Azure AI Foundry concepts (e.g., grounding, orchestration, Azure Agents) and ability to evaluate where it fits in a solution landscape.\n* **Certifications:** Relevant certifications are a strong plus, demonstrating your expertise in Azure and AI. Examples include **Microsoft Certified: Azure Solutions Architect Expert** and **Azure AI Engineer Associate (AI\\-102\\).** Certification in machine learning frameworks or platforms (e.g. **Databricks Certified Generative AI Engineer Associate** ) is also valued. Devoteam supports continuous learning and certification attainment.\n* **Education:** A Bachelor’s or Master’s degree in Computer Science, Data Science, or related field is preferred (or equivalent professional experience).\n\n  \n- You will be part of a collaborative, remote\\-friendly team that values continuous learning and\n  \n\ndelivering impact through modern cloud\\-native data solutions.",
    "url": "https://de.indeed.com/viewjob?jk=d66ba21021e3281e",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "SeniorMicrosoftAzureAIEngineermwd_Devoteam",
    "title": "Senior Microsoft Azure AI Engineer (m/w/d)",
    "company": "Devoteam",
    "location": "Frankfurt am Main, HE, DE",
    "description": "- Do you want to not only experience but actively shape the unique **DNA** of **Microsoft** ? Then **Devoteam M** **Cloud** is the right place for you!\n  \n\n  \n\nOur core business is cloud\\-based enterprise customer projects, where we drive the most modern Microsoft technologies.\n  \n\n  \n\nThe building blocks that distinguish us:\n\n\n\n\t* 2,100 Microsoft certifications completed in 2022\n\t* 1,000 Microsoft experts in EMEA\n\t* 600 customers\n\t* 25 years of industry experience\n\t* 18 Advanced Specializations \\- including \"Azure Virtual Desktop Advanced Specialization\" and \"Modernization of Web Applications to Microsoft Azure\"\n\t* 6 Solution Partner Designations\n\t3 MVPs  \n\t*Imagine being part of one of the most successful IT companies in Europe, leveraging the latest technologies with its customers to elevate them to the next level. Apply now at **Devoteam M Cloud!**\n\n  \n\n\\#Creative Tech For Better Change\n  \n\n  \n\nYour Benefits: **In addition to our revolutionary New Way of Work culture, you'll enjoy:**\n\n\n\t* **Modern offices** in prime locations in Munich and Frankfurt\n\t* **Flexible hybrid working** with the option to customize your working hours to your individual needs\n\t* Our **Devoteam Academy** offers a wide range of certified trainings and language courses\n\t* **International development opportunities** to boost your career at Devoteam\n\t* **Gaming lounge** for your creative break between meetings and calls\n\t* **Get\\-together parties and team events** for regular exchange and fun with your colleagues\n\t* **Employee referral bonuses** for attracting new employees\n\t* **Modern IT equipment** \\- choose the product that suits you best from a variety of options\n\t* **Corporate benefits** with a large selection of numerous offers for almost every area\n\t* **\"Jobrad\" (company bike)** offer with attractive tax advantages for you\n\t* **Company pension scheme, direct insurance, and capital\\-forming benefits** are available to you as additional services\n\t* **Integration Day including mentoring programs** for your perfect start at Devoteam\n\n  \n* **AI Solution Development:** Design and implement end\\-to\\-end AI solutions on Azure. This includes developing machine learning models (e.g. predictive algorithms, classification, anomaly detection) and integrating them into cloud applications. You will write code (primarily in Python) to build and train models, leveraging Azure Machine Learning, Azure Databricks, or custom frameworks as needed.\n* Build and deploy intelligent applications using **Azure AI Foundry** , leveraging prompt orchestration, grounding with Azure AI Search, and agent orchestration features for enterprise\\-scale GenAI use cases. Independently implement GenAI workflows using Foundry.\n* **Generative AI \\& LLMs:** Play a key role in developing **Generative AI** solutions for clients. Experiment with and implement large language model (LLM) based applications using Azure OpenAI Service and frameworks like **LangChain** for building conversational agents or **Retrieval\\-Augmented Generation (RAG)** pipelines. For example, you might build a chatbot that uses an LLM with enterprise data or create a summarization service for insurance documents. Ensure prompt engineering and fine\\-tuning are done in a robust, secure manner.\n* **Azure AI Services Integration:** Utilize Azure Cognitive Services (e.g. for vision, speech, language) and Azure AI services to speed up solution development. For instance, integrate Azure Cognitive Search for semantic search in a knowledge retrieval solution, or use Form Recognizer in a document processing pipeline. Combine these services with custom ML where appropriate to meet client requirements.\n* **MLOps and Deployment:** Take ownership of deploying and operationalizing ML models. You will containerize models or use Azure ML endpoints, set up CI/CD pipelines (using Azure DevOps or GitHub Actions) for automated model training and deployment, and implement monitoring for model performance drift. Ensure that the AI solutions can scale in production and adhere to DevOps best practices for reliability.\n* **Data Pipeline Collaboration:** Work closely with Data Engineers to ensure the data needed for AI models is available, reliable, and well\\-prepared. Contribute to data pipeline design for ML – e.g., help define feature engineering processes or streaming data ingestion for real\\-time inference – so that models can be trained on and serve high\\-quality data.\n* **Cross\\-Functional Collaboration:** Collaborate with Solution Architects (like the ML/AI Architect) to translate high\\-level architectural designs into concrete implementation tasks. Work alongside other specialists such as data scientists and cloud engineers to build **secure, end\\-to\\-end AI solutions** that integrate into the client’s ecosystem. This includes participating in code reviews, knowledge sharing, and troubleshooting sessions within the team.\n* **Client Support \\& Iteration:** Support client teams in adopting and understanding the AI solutions. This could involve preparing technical documentation, demoing functionalities to stakeholders, and iterating on models based on user feedback or changing requirements. Ensure that AI solutions meet responsible AI guidelines and data privacy/security standards as expected by enterprise clients.\n\n  \n* **Experience:** 5\\+ years of hands\\-on experience in AI/ML engineering or data science roles, with a focus on building and deploying solutions (not just research or academic projects). You should have taken multiple ML projects through the full lifecycle from data preparation to production deployment.\n* **Language Skills: fluent in german and english**\n* **Azure \\& Data Skills:** Strong experience with the Azure AI/Data ecosystem. This includes proficiency with **Azure Machine Learning** (for running experiments, managing models), familiarity with **Azure Databricks** or Spark for big data processing, and usage of Azure data services like Data Factory, Azure Data Lake, or Synapse Analytics. Experience integrating Azure Cognitive Services or Azure OpenAI into applications is a big plus.\n* Experience using **Azure AI Foundry** for building LLM\\-based applications or orchestrating AI workflows. Understanding of Foundry templates, grounding data sources, and integration with Azure OpenAI and Azure Search is expected.\n* **ML \\& Programming:** Proficiency in Python and common ML/DL libraries (pandas, scikit\\-learn, TensorFlow or PyTorch, etc.). Ability to write clean, efficient code for data processing and model training. Experience with NLP or computer vision techniques is helpful. You should also be comfortable with Git and collaborative coding practices.\n* **MLOps Knowledge:** Practical understanding of MLOps and model lifecycle management. Experience setting up automated training pipelines, model versioning, CI/CD for ML, and using tools like MLflow for tracking experiments. Knowledge of Docker and Kubernetes (e.g., Azure Kubernetes Service) for deploying ML services is advantageous.\n* **Generative AI \\& LLMs:** Exposure to **Large Language Models** or other generative AI technologies. You should understand how to use pre\\-trained models (like GPT\\-based models) and fine\\-tune or prompt them for specific tasks. Direct experience with libraries/frameworks for LLMs (LangChain, Hugging Face Transformers, etc.) or vector databases for RAG is a strong plus, as many of our projects explore these emerging areas.\n* **Problem\\-Solving \\& Communication:** Strong problem\\-solving skills with the ability to debug complex issues in data pipelines or model performance. Equally important are good communication skills – you can explain technical work to team members and occasionally to client technical staff. You work well in a team and can mentor more junior colleagues if they join (even though we currently hire only experienced professionals).\n* **Certifications:** Azure and data/AI certifications are highly regarded. Ideally, you hold or are willing to obtain **Microsoft Certified: Azure AI Engineer Associate (AI\\-102\\)** certification, which demonstrates ability to design and implement Azure AI solutions. Other relevant certs like Azure Data Scientist (DP\\-100\\) or **Databricks Generative AI Engineer** certification are a bonus. Devoteam will support you with time and resources to achieve certifications.\n* **Education:** Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent work experience). A master’s in AI/Data Science is a plus but not required.\n\n  \n- You will be part of a collaborative, remote\\-friendly team that values continuous learning and\n  \n\ndelivering impact through modern cloud\\-native data solutions.",
    "url": "https://de.indeed.com/viewjob?jk=b58349f0ce090cf0",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "PythonDeveloperRemote_CrossingHurdles",
    "title": "Python Developer | Remote",
    "company": "Crossing Hurdles",
    "location": "Germany",
    "description": "View full details at https://www.linkedin.com/jobs/view/4370016911",
    "url": "https://www.linkedin.com/jobs/view/4370016911",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "PythonDeveloper_Mercor",
    "title": "Python Developer",
    "company": "Mercor",
    "location": "Germany",
    "description": "View full details at https://www.linkedin.com/jobs/view/4370172243",
    "url": "https://www.linkedin.com/jobs/view/4370172243",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "PythonDeveloper-ModelTraining_Mercor",
    "title": "Python Developer - Model Training",
    "company": "Mercor",
    "location": "Germany",
    "description": "View full details at https://www.linkedin.com/jobs/view/4370165428",
    "url": "https://www.linkedin.com/jobs/view/4370165428",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "WorkingStudentInternBackendEngineerfmx_ilert",
    "title": "Working Student / Intern: Backend Engineer (f/m/x)",
    "company": "ilert",
    "location": "Cologne, North Rhine-Westphalia, Germany",
    "description": "View full details at https://www.linkedin.com/jobs/view/4361781941",
    "url": "https://www.linkedin.com/jobs/view/4361781941",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "FullstackEngineerPythonReactallgenders_Kertos",
    "title": "Fullstack Engineer – Python / React (all genders)",
    "company": "Kertos",
    "location": "Berlin, Berlin, Germany",
    "description": "View full details at https://www.linkedin.com/jobs/view/4361758093",
    "url": "https://www.linkedin.com/jobs/view/4361758093",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "SeniorPythonEngineer-AITestingProjectFreelanceMindrift_Mindrift",
    "title": "Senior Python Engineer - AI Testing Project (Freelance, Mindrift)",
    "company": "Mindrift",
    "location": "Cologne, North Rhine-Westphalia, Germany",
    "description": "View full details at https://www.linkedin.com/jobs/view/4370819377",
    "url": "https://www.linkedin.com/jobs/view/4370819377",
    "status": "Saved",
    "date_saved": "2026-02-09",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "SeniorPlatformEngineer-AIInfrastructureObservabilitymfd_actoGmbH",
    "title": "Senior Platform Engineer - AI Infrastructure & Observability (m/f/d)",
    "company": "acto GmbH",
    "location": "Germany",
    "description": "#### **Your Role**\n\n\nWe’re looking for a **Senior Platform Engineer (m/f/d)** excited about building **infrastructure for AI\\-first applications**. You’ll own our cloud platform — from **Kubernetes clusters** running real\\-time voice agents to **ClickHouse analytics pipelines** processing millions of events daily.  \n\nYou’ll tackle novel observability challenges such as **monitoring ClickHouse cluster health**, **ensuring sub\\-200ms latency** for voice AI, and **tracking data pipeline quality**.  \n\nWe’re AI\\-first not just in what we build, but in how we operate — leveraging **AI\\-native tools for incident response** and building automation that uses **LLMs to accelerate debugging and root cause analysis**.\n\n#### **Your Mission**\n\n* **Automate Incident Management:** Implement **AI\\-native incident management tools** to accelerate response and automate root cause analysis.\n* **Manage Cloud Infrastructure:** Operate and optimize **AWS EKS infrastructure** with **Terraform**, tailored for AI workloads and analytics pipelines.\n* **Ensure Data Reliability:** Maintain **ETL workflows**, **ClickHouse cluster health**, and **batch jobs**, ensuring data freshness and quality.\n* **Optimize System Performance:** Design **API failover strategies**, implement caching layers, and continuously optimize infrastructure.\n* **Improve Developer Experience:** Maintain **Skaffold\\-based** local development environments, enhance **CI/CD pipelines**, and build internal productivity tooling.\n* **Enhance Observability:** Implement and monitor **SLOs**, use **AI tools for log analysis**, and improve visibility through **structured logging**.\n\n#### **Your profile: What you need to succeed**\n\n* **Infrastructure Expertise:** 5\\+ years of software engineering experience and 3\\+ years running **Kubernetes in production** (AWS EKS preferred).\n* **IaC Mastery:** Strong **Terraform** and **GitOps workflows** experience, with deep AWS knowledge (VPCs, RDS, ElastiCache, Lambda).\n* **Data \\& AI Focus:** Experience monitoring **ETL pipelines** and **analytics workloads** (ClickHouse, Redshift, BigQuery), and excitement for **AI\\-native operations tools** such as log analysis or automated remediation.\n* **Backend \\& Leadership:** Proficient in **Python** or **Kotlin/Java**, familiar with **FastAPI**, **Spring Boot**, **Django**, or **gRPC**. Able to work independently, mentor others, and drive technical decisions.\n* **Mindset:** Strong written communication skills, comfort with ambiguity, and motivation to build at the intersection of **AI and infrastructure**.\n\n#### **Why Acto?**\n\n* **Development Opportunities**: Steep development opportunities without entrenched hierarchies.\n* **Culture:** We are an ambitious team that wants to achieve a lot with Acto, but we don't take ourselves too seriously and like to have fun together, be it working together or at regular team events.\n* **Flexibility:** Berlin\\-based with flexible remote work. You can work from home often, with regular in\\-person time in our Berlin office, particularly for key meetings and collaboration.\n* **Health \\& work\\-life balance:** Enjoy 30 days of vacation and an attractive Wellhub membership.\n* **Ownership:** Whether you are an intern or a full\\-time acto\\-naut, Acto instills a deep sense of ownership, where every team member is entrusted with meaningful responsibilities and the autonomy to make impactful decisions.\n* **Equipment:** You will receive a state\\-of\\-the\\-art hardware setup with a choice between Mac and Windows.\n\n#### **About us**\n\n\nActo is building the revenue intelligence layer for modern commercial teams. We turn complex ERP and CRM data into clear, actionable insights that help companies make smarter, faster revenue decisions.  \n\n  \n\nWe believe the future of commercial excellence is proactive, data\\-driven, and intelligently automated. Instead of adding more dashboards, we focus on delivering clarity and measurable impact where it matters most.  \n\n  \n\nFounded in 2021, we’re already working with renowned mid\\-sized companies and are backed by experienced investors such as 468 Capital and Cusp Capital.  \n\n  \n\nWe’re still early, which means real ownership, real speed, and real influence. If you’re excited about shaping a category at the intersection of AI, data, and commercial strategy, Acto is the place to do it.",
    "url": "https://www.glassdoor.de/job-listing/j?jl=1010030573193",
    "status": "Saved",
    "date_saved": "2026-02-11",
    "date_posted": "2026-02-11",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "SeniorAIEngineerwmd_BWIGmbH",
    "title": "Senior AI Engineer (w/m/d)",
    "company": "BWI GmbH",
    "location": "Berlin",
    "description": "Stellenbeschreibung\n\n\nSorge gemeinsam mit uns für die digitale Zukunftsfähigkeit der Bundeswehr.\nAls primärer Digitalisierungspartner der Bundeswehr erbringen wir stabile, sichere und effiziente IT\\-Services im In\\- und Ausland, vom Grundbetrieb bis in den einsatznahen Bereich und tragen so zur kontinuierlichen Erhöhung der Führungs\\- und Einsatzfähigkeit der Bundeswehr bei. Mit über 8\\.000 Kolleg\\*innen betreiben und modernisieren wir eine der größten und komplexesten IT\\-Infrastrukturen in Deutschland. Wir suchen verantwortungsvolle IT\\-Spezialist\\*innen, die die Bundeswehr\\-IT aus Überzeugung in herausfordernden Digitalisierungsvorhaben weiterentwickeln und so einen Beitrag zur Sicherheit Deutschlands leisten wollen.\n\n\nWir im **Technology Engineering Team** sind als Teil vom **Chief Technology Office (CTO)** mitverantwortlich für die strategische Erneuerung des Leistungsportfolios der BWI. Unser Auftrag ist es eine KI\\-Service Plattform zu entwickeln und zu betreiben, über welche Mitarbeitende der BWI Zugriff auf modernste KI\\-Technologie erhalten. Hierzu verbinden wir Innovation und Forschung zur Künstlichen Intelligenz mit Best Practices aus DevSecOps und MLOps. Aktuell bauen wir ein starkes Team mit Expertise in unterschiedlichen Bereichen der KI\\-Entwicklung auf.  \n\nWerde auch Du Teil unseres Teams und unterstütze uns auf unserer gemeinsamen Mission!\n\n\nDEINE AUFGABEN:\n\n\n* Architektur und Entwicklung der zentralen KI\\-Plattform unter Verwendung von Techniken wie MCP, A2A und AG\\-UI\n* Implementierung LLM\\-basierter Agenten mithilfe gängiger Python\\-Frameworks (z.B. LangGraph, CrewAI, PydanticAI)\n* Entwicklung und Optimierung der Kern\\-API für die KI\\-Plattform (z. B. REST/GraphQL) zur Integration von ML\\-Modellen\n* Sicherstellung der Skalierbarkeit, Zuverlässigkeit und Performance der API unter Last (z. B. Caching, Rate Limiting)\n* Zusammenarbeit mit MLOps Engineers zur Verbindung von Modellen und Infrastruktur (GPU\\-Cluster, Kubernetes)\n* Implementierung von Sicherheitsmechanismen (API\\-Gateways, Token\\-Authentifizierung)\n* Dokumentation und Support für interne sowie externe Entwickler\nDEIN PROFIL:\n\n\n* Abgeschlossenes Masterstudium der Informatik, Mathematik oder einer vergleichbaren Fachrichtung\n* Mindestens 5 Jahre relevante Berufserfahrung nach Abschluss des Studiums zwingend erforderlich\n* Erfahrung in Backend\\-Entwicklung mit Python, Go, Rust oder Java\n* Erfahrung in API\\-Design wie REST, GraphQL, gRPC, MQTT oder WebSockets\n* Erfahrung mit On\\-Prem Cloud\\-Techniken (z. B. Kubernetes) und ML\\-Operations\\-Frameworks\n* Expertise in Leistungsoptimierung und Monitoring (z. B. Prometheus, Grafana)\n* Erfahrung mit Datenbanken (SQL/NoSQL) und Storage\\-Systemen\n* Erfahrung mit ML\\-Modellen und deren Integration in APIs\n* Verhandlungssichere Deutschkenntnisse sowie sehr gute Englischkenntnisse in Wort und Schrift\nWIR BIETEN:\n\n\n* Durch abwechslungsreiche und gesellschaftlich relevante Aufgaben gewährleisten wir den reibungslosen IT\\-Betrieb und die Digitalisierung der Bundeswehr\n* Das Ziel eint uns. Dabei sind für uns ein wertschätzender Umgang miteinander sowie ein großer Teamgeist elementar\n* Die BWI bietet eine marktgerechte Vergütung, einen sicheren Arbeitsplatz sowie eine prämierte und arbeitgeberfinanzierte betriebliche Altersvorsorge\n* Du startest grundsätzlich mit 30 Tagen Jahresurlaub mit Option auf individuelle Anpassungen\n* Über unsere Benefit\\-App steht Dir ein monatliches Guthaben und Steuervergünstigungen auf Tickets für den ÖPNV zur Verfügung\n* Wir ermöglichen Dir Flexibilität, um Beruf und Privatleben in Einklang zu bringen, etwa durch mobiles Arbeiten oder Vertrauensarbeitszeit und dem langfristigen Aufbau eines Wertguthabenkontos für z.B. ein Sabbatical\n* Wir unterstützen Deine berufliche und persönliche Weiterbildung durch individuelle Maßnahmen sowie einen kostenfreien Zugriff auf LinkedIn Learning\n* Neben der Möglichkeit ein Jobrad zu leasen, profitierst Du von zahlreichen Angeboten aus den Bereichen Sport und Ernährung",
    "url": "https://www.glassdoor.de/job-listing/j?jl=1010029788504",
    "status": "Saved",
    "date_saved": "2026-02-11",
    "date_posted": "2026-02-11",
    "notes": "",
    "match_score": 0
  }
]