[
  {
    "id": "SeniorShopifySolutionArchitectmwd_StrixGroupBV",
    "title": "Senior Shopify Solution Architect (m/w/d)",
    "company": "Strix Group B.V.",
    "location": "Eschborn",
    "description": "#### **Wen wir suchen**\n\n\nWir suchen engagierte Teamplayer:innen mit einem ausgeprägten technischen Verständnis und strategischem Denkvermögen, die Freude daran haben, komplexe E\\-Commerce\\-Herausforderungen zu lösen. Wenn Dir Teamwork, gegenseitige Wertschätzung und Eigenverantwortung ebenso wichtig sind wie technologische Exzellenz, kreative Freiheit und sinnstiftende Arbeit – dann bist Du bei uns richtig. Du willst gestalten, statt nur umzusetzen? Dann freuen wir uns auf Dich.\n\n#### **Was Dich erwartet**\n\n* Du entwickelst **skalierbare technische Architekturen für anspruchsvolle Shopify Plus\\-Projekte** – von der Idee bis zur Umsetzung.\n* Du arbeitest eng mit Sales, Consulting, Design und Development zusammen und **bringst Deine technische Perspektive in jede Projektphase** ein.\n* Du bist **aktiv in die technische Umsetzung eingebunden** und übernimmst Verantwortung für Testing, QA und Betrieb.\n* Du entwickelst **technische Standards, Guidelines und begleitest Risikobewertungen** zur Sicherstellung von Qualität und Zukunftsfähigkeit.\n* Du **gestaltest Prozesse, Workflows und Methoden aktiv mit** – immer mit Blick auf Effizienz, Innovation und Kundennutzen.\n* Du trittst als **Thought Leader im Shopify\\- und E\\-Commerce\\-Bereich** auf – intern wie extern.\n* Du hältst Dich über **aktuelle Technologien und Trends im Shopify\\-Ökosystem** auf dem Laufenden und teilst dieses Wissen aktiv.\n* Du bist **bereit, gelegentlich zu reisen**, um Kund:innen oder Teams vor Ort optimal zu unterstützen.\n\n**Stellenanforderungen**\n------------------------\n\n\n#### **Was du mitbringen solltest**\n\n* **Mehrjährige Erfahrung in der Konzeption und Umsetzung skalierbarer, Shopify\\-Plus Architekturen** im E\\-Commerce.\n* **Fundiertes Know\\-how moderner Webtechnologien, Frameworks sowie Erfahrung mit dem Shopify\\-Ökosystem** und relevanten Integrationen (z. B. gadget.dev, Patchworks).\n* Strategisches Denken gepaart mit der **Fähigkeit, technische Visionen in konkrete Maßnahmen** für Teams und Kund:innen zu **übersetzen**.\n* Hohe kommunikative **Kompetenz zur Vermittlung komplexer technischer Themen** an unterschiedliche Stakeholder.\n* Bereitschaft zur **Übernahme von Verantwortung und Erfahrung als technischer Sparringspartner** für verschiedene Bereiche (Consulting, Design, Sales, Development).\n* Erfahrung im Coaching oder der Anleitung von Kolleg:innen – **Du teilst Dein Wissen gern**.\n* **Strukturierte, lösungsorientierte und selbstständige Arbeitsweise** mit hoher Qualitätsorientierung.\n* Neugier und **Offenheit, Bestehendes zu hinterfragen** und aktiv zu verbessern.\n* Fließende **Deutsch\\- und Englischkenntnisse** in Wort und Schrift.\n\n#### **Was wir dir bieten**\n\n* Unbefristete **Festanstellung** mit einem attraktiven Gehaltspaket.\n* **30 Tage Urlaub** pro Jahr.\n* **Flexible, familienfreundliche Arbeitszeiten** und verschiedene Arbeitszeitmodelle.\n* **Remote\\-Work** und bis zu 183 Tage **Workation im EU\\-Ausland**.\n* **Hochwertige technische Ausstattung** deiner Wahl innerhalb des Mac\\-Universums.\n* **Regelmäßige Mitarbeiterevents** (z. B. Sommer\\- und Weihnachtsfeier).\n* Vielfältige **Entwicklungs\\- und Weiterbildungsmöglichkeiten** (z. B. interne Schulungen zu Gewaltfreier Kommunikation, Getting Things Done).\n* Betriebliche **Altersvorsorge mit 20 % Zuschuss**.\n* Zugang zu **Mitarbeiterangeboten über Corporate Benefits**.\n* **JobRad\\-Leasing** für umweltfreundliche Mobilität.\n\n\nDu hast Fragen zu weiteren möglichen Benefits? Mit uns kannst du über alles sprechen!",
    "url": "https://www.glassdoor.de/job-listing/j?jl=1010023436195",
    "status": "Saved",
    "date_saved": "2026-02-05",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "SAPAIEngineeringArchitectfmd_SAP",
    "title": "SAP AI Engineering Architect (f/m/d)",
    "company": "SAP",
    "location": "Deutschland",
    "description": "**We help the world run better**  \n\nAt SAP, we keep it simple: you bring your best to us, and we'll bring out the best in you. We're builders touching over 20 industries and 80% of global commerce, and we need your unique talents to help shape what's next. The work is challenging – but it matters. You'll find a place where you can be yourself, prioritize your wellbeing, and truly belong. What's in it for you? Constant learning, skill growth, great benefits, and a team that wants you to grow and succeed.  \n\nWe are seeking an experienced SAP AI Engineering Architect (f/m/d) to lead the design, development, and implementation of AI\\-driven solutions within our SAP ecosystem. The ideal candidate will possess deep expertise in SAP technologies, AI frameworks, and SAP Business Technology Platform (BTP), ensuring seamless integration and optimization of AI capabilities to drive business innovation and efficiency.\n\n **What you´ll build**\n\n* Architect and implement AI solutions within SAP systems to enhance business processes and decision\\-making.\n* Design and deploy scalable, secure, and high\\-performing AI powered applications on SAP BTP.\n* Utilize SAP BTP services such as SAP Generative AI Hub, SAP AI Core, SAP AI Business Services, SAP Integration Suite etc. to develop innovative solutions.\n* Develop and manage APIs and microservices using SAP BTP tools for seamless integration across SAP and non\\-SAP systems.\n* Leverage SAP BTP capabilities for data orchestration, analytics, and machine learning model deployment.\n* Collaborate with cross\\-functional teams to identify opportunities for AI integration and automation within SAP landscapes.\n* Optimize SAP systems for AI\\-driven analytics, predictive insights, and real\\-time decision\\-making.\n* Ensure compliance with data governance, security standards, and SAP best practices.\n* Provide technical leadership and mentorship to development teams.\n* Stay updated on emerging AI technologies and SAP BTP advancements to drive innovation.\n **What you bring**\n\n* Bachelor’s or Master’s degree in Computer Science, Engineering, or related field and/or 10 years expertise in various applicable technical roles.\n* Proven experience as an SAP Architect with expertise in AI technologies and SAP BTP.\n* Proficiency in SAP BTP services, including SAP AI Core, SAP AI Business Services, SAP Integration Suite, and SAP Extension Suite.\n* Strong knowledge of machine learning frameworks (e.g., TensorFlow, PyTorch) and programming languages (e.g., Python, Java).\n* Excellent problem\\-solving, communication, and leadership skills.\n* Familiarity with SAP HANA Cloud, SAP Data Intelligence, and SAP Analytics Cloud, Vector Engines, Knowledge Graphs, A2A and MCP technologies.\n* Experience with SAP S/4HANA integration and extensions using SAP BTP preferred.\n* Front End Knowledge in JavaScript, HTML, Fiori Web components (desirable), calling APIs.\n* Knowledge of data governance, security best practices, and SAP Fiori application development.\n* An AI Powered Mindset and understanding of Generative AI \\& Prompt Engineering.\n* Excellent verbal and written communication skills in English \\& German.\n* Strong business process acumen; ability to understand the challenges you are asked to solve.\n  \n\n\\#AI26\n\n\n\\#SAPAICareers\n\n  \n\n**Bring out your best**  \n\nSAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end\\-to\\-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with two hundred million users and more than one hundred thousand employees worldwide, we are purpose\\-driven and future\\-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, you can bring out your best.\n  \n\n  \n\n**We win with inclusion**  \n\nSAP’s culture of inclusion, focus on health and well\\-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better world.  \n\n  \n\nSAP is committed to the values of Equal Employment Opportunity and provides accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e\\-mail with your request to Recruiting Operations Team: Careers@sap.com.  \n\n  \n\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.\n\n **AI Usage in the Recruitment Process**\nFor information on the responsible use of AI in our recruitment process, please refer to our Guidelines for Ethical Usage of AI in the Recruiting Process.\nPlease note that any violation of these guidelines may result in disqualification from the hiring process.  \n\n  \n\nRequisition ID: 446679 \\| Work Area: Consulting and Professional Services \\| Expected Travel: 0 \\- 50% \\| Career Status: Professional \\| Employment Type: Regular Full Time \\| \\#LI\\-Hybrid",
    "url": "https://www.glassdoor.de/job-listing/j?jl=1010024225903",
    "status": "Offer",
    "date_saved": "2026-02-05",
    "notes": "",
    "match_score": 0
  },
  {
    "id": "Full-StackEngineermfd_DaedalusGmbH",
    "title": "Full-Stack Engineer (m/f/d)",
    "company": "Daedalus GmbH",
    "location": "Karlsruhe",
    "description": "#### **About the opportunity**\n\n\nDo you live for solving complex problems and delivering top\\-notch software? Daedalus has the right challenge for you! We're looking for a Full\\-Stack Engineer who's keen about delivering our innovative software stack for real\\-time management of complex industrial processes that sets the bar for the industry.  \n\nThis position can be filled at Intermediate level depending on experience and skills.  \n\nThe annual gross salary ranges from €55,000 to €66,000\\.  \n\nPlacement within this range is determined based on professional experience, technical expertise, and scope of responsibility.#### **What you'll do at Daedalus**\n\n* Build and ship the tech stack that runs our factory of the future. This includes but is not limited to production scheduling, workflow orchestration, real\\-time integration with industrial machines, etc.\n* Own features end to end, with a focus on either frontend or backend but willing to jump in to fill in the other pieces where needed as we're emphasizing a holistic approach to software development\n* Collaborate with cross\\-functional teams to integrate software solutions into a fascinating and challenging business domain\n* Ensure the scalability, security, and performance of our software systems\n* Work closely with our product team to develop user stories and drive the conversation around what are the best opportunities to add business value\n\n#### **Who you are**\n\n* 2\\+ years of hands\\-on experience building and maintaining modern web applications across the stack – from intuitive frontend interfaces to robust backend systems\n* Proven experience in shipping real software products in complex enterprise SaaS web applicatio\n* You have a strong technical and delivery mindset and are comfortable making technical decisions that balance speed, quality, and long\\-term maintainability\n* You thrive in collaborative environments, contribute actively to team discussions, and mentor less experienced engineers when appropriate\n* Eagerness to develop generalist skills in addition to deepening expertise in frontend and backend technologies\n* You have profound experience in using modern technologies to build applications. At Daedalus, we use Python, Django, React.JS, TypeScript, Docker, Kubernetes, and Bazel. However, you don't need to have experience using exactly this stack already; what we look for is someone who can learn new tools quickly and can pick the best tool for the task at hand\n\n#### **What's in it for you**\n\n* Work with purpose and ambition in one of the most exciting and innovative manufacturing facilities in Germany\n* Close collaboration with an international team from the fields of manufacturing, artificial intelligence, software, robotics, and operations\n* Free lunch, fruits, and drinks every day\n* 30 days of vacation\n* Capital\\-forming benefits\n* Employee Stock Ownership Plan\n* Bike leasing via BusinessBike\n* Regular team events (e.g. summer party, barbecue evenings, Christmas party, etc.)\n\n#### **About us**\n\n\nDaedalus is a different kind of startup. We are a team of world\\-class engineers and manufacturing gurus on a mission to build the world's first autonomous factory that can build anything.  \n\nWith our world\\-leading experience from OpenAI, Google, SpaceX, Stripe, Blue Origin, Cruise and others, and venture backing from some of the biggest names in tech including Addition, Khosla Ventures and Y Combinator, we believe that revolutionary results can be built by a small group of creative minds working in concert. Join us on our journey to build the autonomous factory of the future to make precision components for spacecraft, medical devices, robotics, industrial machinery and many others. We are currently ramping up our first large factory in Germany and need your help to make it even more efficient and duplicate it across the globe.",
    "url": "https://www.glassdoor.de/job-listing/j?jl=1010021514864",
    "status": "Saved",
    "date_saved": "2026-02-05",
    "notes": "",
    "match_score": 0
  }
]